VuDaiDuong-23520359/MPU-MCU_project/STM32/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "math.h"
#include "time.h"
#include "stdlib.h"
#include "stdbool.h"
#include <stdio.h>
#include "stm32f4xx.h"

#define ARM_MATH_CM4
#include "arm_math.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define MAX_LED 54

#define MAX_BRIGHTNESS 45
#define NORMAL_BRIGHTNESS 20
#define USE_BRIGHTNESS 1

// for FFT
#define FFT_BUFFER_SIZE 2048
#define SAMPLE_RATE_HZ 14400.0f
#define UINT16_TO_FLOAT 0.00001525879f

//for button
#define BUTTON_GPIO_PORT GPIOE
#define BUTTON_PIN GPIO_PIN_11


/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;
DMA_HandleTypeDef hdma_tim1_ch1;

/* USER CODE BEGIN PV */
uint16_t LED_DURATION_MS = 100;
uint16_t amp = 0;
bool led_is_on = false;
uint32_t led_on_start = 0;

uint8_t LED_Data[MAX_LED][4];
uint8_t LED_Mod[MAX_LED][4];
int datasentflag = 0;
uint16_t pwmData[(24 * MAX_LED)+50];
uint16_t  effStep = 0;

uint16_t dynamic_threshold = 20;
uint8_t colors[7][3] = {
    {255, 0, 0},     // Red
    {255, 127, 0},   // Orange
    {255, 255, 0},   // Yellow
    {0, 255, 0},     // Green
    {0, 0, 255},     // Blue
    {75, 0, 130},    // Indigo
    {148, 0, 211}    // Violet
};

int16_t middle_point_index = 32;
uint32_t middle_point = 0;

int amp_maxn = 1600; 	// Noise
int amp_maxq = 1000;	// Quiet

// for FFT
uint16_t peakHz = 0;
arm_rfft_fast_instance_f32 fftHandler;
float fftBufIn[FFT_BUFFER_SIZE];
float fftBufOut[FFT_BUFFER_SIZE];
uint16_t fftIndex = 0;
uint8_t fftReady = 0;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_TIM1_Init(void);
static void MX_ADC1_Init(void);
static void MX_TIM2_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

///////////////////////////////////
//Button
int read_button_state(void) {
    return HAL_GPIO_ReadPin(BUTTON_GPIO_PORT, BUTTON_PIN);
}

#define DEBOUNCE_DELAY_MS 50

int current_effect = 0;
const int EFFECT_COUNT = 5;
uint32_t last_button_time = 0;

void check_button_and_switch_effect(void) {
    static int last_button_state = 1;  // Giả sử nút active LOW, lúc chưa nhấn = HIGH (1)
    int button_state = read_button_state();

    if (button_state != last_button_state) {
        last_button_time = HAL_GetTick();
    }

    if ((HAL_GetTick() - last_button_time) > DEBOUNCE_DELAY_MS) {
        if (button_state == 0 && last_button_state == 1) {
            // Nút vừa được nhấn
            current_effect++;
            if (current_effect >= EFFECT_COUNT) current_effect = 0;
        }
    }

    last_button_state = button_state;
}
/////////////////////////////////////

void record_sample_and_maybe_runFFT(void) {
    // Convert raw 12‐bit ADC (0..4095) to float in [-1,+1], after centering around middle_point
	uint16_t raw_adc = HAL_ADC_GetValue(&hadc1);

    float centered = ((float)(raw_adc - (uint16_t)(middle_point))) * UINT16_TO_FLOAT;
    fftBufIn[fftIndex] = centered;
    fftIndex++;

    if (fftIndex >= FFT_BUFFER_SIZE) {
        // Run the RFFT in place: fftBufIn → fftBufOut
        arm_rfft_fast_f32(&fftHandler, fftBufIn, fftBufOut, 0);

        fftReady = 1;
        fftIndex = 0; // reset buffer index to record next block
    }
}







void HAL_TIM_PWM_PulseFinishedCallback(TIM_HandleTypeDef *htim) {
    if (htim == &htim1) {
        HAL_TIM_PWM_Stop_DMA(&htim1, TIM_CHANNEL_1);
        datasentflag = 1;
    }
}


void Set_LED (int LEDnum, int Red, int Green, int Blue)
{
	LED_Data[LEDnum][0] = LEDnum;
	LED_Data[LEDnum][1] = Green;
	LED_Data[LEDnum][2] = Red;
	LED_Data[LEDnum][3] = Blue;
}

void Set_Brightness (int brightness)  // 0–NORMAL_BRIGHTNESS
{
#if USE_BRIGHTNESS
    if (brightness > NORMAL_BRIGHTNESS) brightness = NORMAL_BRIGHTNESS;
    float scale = brightness / (float)NORMAL_BRIGHTNESS;

    for (int i = 0; i < MAX_LED; i++)
    {
        // preserve the “LED number” byte
        LED_Mod[i][0] = LED_Data[i][0];
        // scale each color channel linearly
        LED_Mod[i][1] = (uint8_t)(LED_Data[i][1] * scale);
        LED_Mod[i][2] = (uint8_t)(LED_Data[i][2] * scale);
        LED_Mod[i][3] = (uint8_t)(LED_Data[i][3] * scale);
    }
#endif
}

void WS2812_Send (void)
{
	uint32_t indx=0;
	uint32_t color;


	for (int i= 0; i<MAX_LED; i++)
	{
#if USE_BRIGHTNESS
		color = ((LED_Mod[i][1]<<16) | (LED_Mod[i][2]<<8) | (LED_Mod[i][3]));
#else
		color = ((LED_Data[i][1]<<16) | (LED_Data[i][2]<<8) | (LED_Data[i][3]));
#endif

		for (int i=23; i>=0; i--)
		{
			if (color&(1<<i))
			{
				pwmData[indx] = 60;  // 2/3 of 90
			}

			else pwmData[indx] = 30;  // 1/3 of 90

