VuDaiDuong-23520359/MPU-MCU_project/STM32/Core/Src/main.c
			indx++;
		}

	}

	for (int i=0; i<50; i++)
	{
		pwmData[indx] = 0;
		indx++;
	}

	HAL_TIM_PWM_Start_DMA(&htim1, TIM_CHANNEL_1, (uint32_t *)pwmData, indx);
	while (!datasentflag){};
	datasentflag = 0;
}

void HSV_to_RGB(float h, float s, float v, uint8_t* r, uint8_t* g, uint8_t* b) {
    int i = (int)(h / 60.0f) % 6;
    float f = (h / 60.0f) - i;
    float p = v * (1.0f - s);
    float q = v * (1.0f - f * s);
    float t = v * (1.0f - (1.0f - f) * s);

    float r_, g_, b_;

    switch (i) {
        case 0: r_ = v; g_ = t; b_ = p; break;
        case 1: r_ = q; g_ = v; b_ = p; break;
        case 2: r_ = p; g_ = v; b_ = t; break;
        case 3: r_ = p; g_ = q; b_ = v; break;
        case 4: r_ = t; g_ = p; b_ = v; break;
        default: r_ = v; g_ = p; b_ = q; break;
    }

    *r = (uint8_t)(r_ * 255);
    *g = (uint8_t)(g_ * 255);
    *b = (uint8_t)(b_ * 255);
}

//effect
void Set_LEDs_color_at_once(int start, int end, int step, int r, int g, int b){
	for (int pos = start; pos < end; pos += step){
		Set_LED(pos, r, g, b);		// purple
	}
}

void Turn_on_all_at_once(int r, int g, int b, int to_led){
	Set_LEDs_color_at_once(0, to_led, 1, r, g, b);
	Set_Brightness(NORMAL_BRIGHTNESS);
	WS2812_Send();
}

void Turn_off_all_at_once(void){
	Set_LEDs_color_at_once(0, MAX_LED, 1, 0, 0, 0);
	Set_Brightness(NORMAL_BRIGHTNESS);
	WS2812_Send();
}

void get_rainbow_color(uint16_t index, uint16_t effStep, uint8_t *red, uint8_t *green, uint8_t *blue)
{
    // Compute a “phase” value in [0, 59], matching the original rainbow_effect logic
    int16_t temp = (int16_t)(effStep - index * 1.2f);
    int16_t mod  = temp % 60;            // may be negative or positive
    if (mod < 0) mod += 60;              // ensure 0 ≤ mod < 60
    uint16_t ind = 60 - mod;             // ind in [1, 60]
    ind = ind % 60;                      // now in [0, 59]

    // Determine which third of the 60-step “wheel” we’re in
    uint16_t segment = (ind % 60) / 20;  // 0 → red→green, 1 → green→blue, 2 → blue→red

    float factor1, factor2;
    uint8_t rr = 0, gg = 0, bb = 0;

    switch (segment) {
        case 0:
            // Transition red → green
            // factor1 goes from 1 → 0 over 20 steps; factor2 goes from 0 → 1
            factor1 = 1.0f - ((float)(ind % 20) / 20.0f);
            factor2 = ((float)(ind % 20) / 20.0f);
            rr = (uint8_t)(255.0f * factor1);
            gg = (uint8_t)(255.0f * factor2);
            bb = 0;
            break;

        case 1:
            // Transition green → blue
            factor1 = 1.0f - ((float)((ind % 60) - 20) / 20.0f);
            factor2 = ((float)((ind % 60) - 20) / 20.0f);
            rr = 0;
            gg = (uint8_t)(255.0f * factor1);
            bb = (uint8_t)(255.0f * factor2);
            break;

        case 2:
            // Transition blue → red
            factor1 = 1.0f - ((float)((ind % 60) - 40) / 20.0f);
            factor2 = ((float)((ind % 60) - 40) / 20.0f);
            rr = (uint8_t)(255.0f * factor2);
            gg = 0;
            bb = (uint8_t)(255.0f * factor1);
            break;
    }

    // Store results
    *red = rr;
    *green = gg;
    *blue = bb;
}

// Helper function to map frequency to color temperature (warm to cool)
void frequency_to_color_temp(uint16_t freq, uint8_t* r, uint8_t* g, uint8_t* b) {
    if (freq < 250) {
        // Low frequencies: Warm colors (Red to Orange)
        float ratio = (float)freq / 250.0f;
        *r = 255;
        *g = (uint8_t)(ratio * 165); // Orange component
        *b = 0;
    } else if (freq <= 2000) {
        // Mid frequencies: Yellow to Green
        float ratio = (float)(freq - 250) / 1750.0f;
        *r = (uint8_t)(255 * (1.0f - ratio)); // Fade out red
        *g = 255;
        *b = 0;
    } else {
        // High frequencies: Cool colors (Green to Blue to Violet)
        float ratio = (freq - 2000) / 18000.0f; // Up to 20kHz
        if (ratio > 1.0f) ratio = 1.0f;

        if (ratio < 0.5f) {
            // Green to Blue
            float t = ratio * 2.0f;
            *r = 0;
            *g = (uint8_t)(255 * (1.0f - t));
            *b = (uint8_t)(255 * t);
        } else {
            // Blue to Violet
            float t = (ratio - 0.5f) * 2.0f;
            *r = (uint8_t)(128 * t);
            *g = 0;
            *b = 255;
        }
    }
}

// Helper function to map frequency to full spectrum (Red to Violet)
void frequency_to_full_spectrum(uint16_t freq, uint8_t* r, uint8_t* g, uint8_t* b) {
    // Map frequency to hue (0-300 degrees)
    float hue = (float)freq / 7000.0f * 300.0f; // 0-7kHz mapped to 0-300°
    if (hue > 300.0f) hue = 300.0f;

    HSV_to_RGB(hue, 1.0f, 1.0f, r, g, b);

}

void effect_sound_color() {
    float ratio = (float)amp / amp_maxn;
    if (ratio > 1.0) ratio = 1.0;
    if (ratio <= 0.05f) {
    	Turn_off_all_at_once();
    	WS2812_Send();
    	return;
    }

    int brightness = 5 + (int)(ratio * (NORMAL_BRIGHTNESS - 5));
    Set_Brightness(brightness);

    uint8_t r, g, b;

    if (ratio < 0.5f) {
        float t = ratio / 0.5f;
        r = (uint8_t)(0 + t * (148 - 0));
        g = 0;
        b = (uint8_t)(255 + t * (211 - 255));
    } else {
        float t = (ratio - 0.5f) / 0.5f;
        if (t < 0.5f) {
            float t2 = t / 0.5f;
            r = 255;
            g = (uint8_t)(0 + t2 * (127 - 0));
            b = 0;
        } else {
            float t2 = (t - 0.5f) / 0.5f;
            r = 255;
            g = (uint8_t)(127 + t2 * (255 - 127));
            b = 0;
        }
    }

    for (int i = 0; i < MAX_LED; i++) {
        Set_LED(i, r, g, b);
    }
    WS2812_Send();
}

void ripple_effect(uint16_t amplitude) {
    float ratio = (float)amplitude / amp_maxn;
    if (ratio > 1.0f) ratio = 1.0f;

    if (ratio <= 0.05f) {
        Turn_off_all_at_once();
        WS2812_Send();
        return;
    }

    int center = MAX_LED / 2;
    int spread = 1 + (int)(ratio * (MAX_LED / 2));

    for (int i = 0; i < MAX_LED; i++) {
        int dist = abs(i - center);
        float brightness = 1.0f - ((float)dist / spread);
        if (brightness < 0.0f) brightness = 0.0f;

        // Get rainbow color based on position
        uint8_t r, g, b;
        get_rainbow_color(i, effStep, &r, &g, &b);

        // Apply brightness modulation to color
        Set_LED(i, (uint8_t)(r * brightness), (uint8_t)(g * brightness), (uint8_t)(b * brightness));
    }

    Set_Brightness(NORMAL_BRIGHTNESS);
    WS2812_Send();

    effStep = (effStep + 1) % 60;
}


void sound_bar_hue_gradient(uint16_t amplitude) {
    static int current_led_count = 1;
    int target_led_count;

    float ratio = (float)amplitude / amp_maxn;
    if (ratio > 1.0f) ratio = 1.0f;

