VuDaiDuong-23520359/MPU-MCU_project/STM32/Core/Src/main.c
    target_led_count = (int)(ratio * MAX_LED);
    if (target_led_count < 1) target_led_count = 1;

    if (amplitude < 100 && current_led_count > 1) {
        current_led_count--;
    } else if (target_led_count > current_led_count) {
        current_led_count++;
    }

    Turn_off_all_at_once();

    for (int i = 0; i < current_led_count; i++) {
        float t = (float)i / (current_led_count - 1);
        float hue = 270.0f * (1.0f - t); // tím (270°) → đỏ (0°)

        uint8_t r, g, b;
        HSV_to_RGB(hue, 1.0f, 1.0f, &r, &g, &b);
        Set_LED(i, r, g, b);
    }

    Set_Brightness(NORMAL_BRIGHTNESS);
    WS2812_Send();
}

void effect_random_one_in_six_leds_by_sound(uint16_t amplitude) {
    float ratio = (float)amplitude / amp_maxn;
    if (ratio > 1.0f) ratio = 1.0f;

    // Ignore low amplitude (silence)
    if (ratio <= 0.05f) {
        Turn_off_all_at_once();
        WS2812_Send();
        return;
    }

    Turn_off_all_at_once();

    const int group_size = 6; //per n Led will have 1 random led lighted
    for (int start = 0; start < MAX_LED; start += group_size) {
        int rand_index = rand() % group_size;
        int led_index = start + rand_index;
        if (led_index >= MAX_LED) break;

        // Optional: brighter when louder
        uint8_t brightness = (uint8_t)(ratio * 255);
        uint8_t r = brightness;
        uint8_t g = rand() % brightness;
        uint8_t b = rand() % brightness;

        Set_LED(led_index, r, g, b);
    }

    Set_Brightness(5 + (int)(ratio * (NORMAL_BRIGHTNESS - 5)));
    WS2812_Send();
}

#define AMP_THRESHOLD 1000     // Amplitude threshold to detect a beat
#define FADE_DURATION_MS 500   // Fade duration in milliseconds
void effect_flash_fade_random_color(uint16_t amp, uint16_t peakHz) {
    static uint32_t last_flash_time = 0;  // Time of the last flash

    uint32_t current_time = HAL_GetTick();  // Current time in milliseconds

    // Beat detection: Check if amplitude exceeds threshold
    if (amp > AMP_THRESHOLD) {
        // Generate a random RGB color (0-255)
        uint8_t r = rand() % 256;
        uint8_t g = rand() % 256;
        uint8_t b = rand() % 256;

        // Set all LEDs to the new random color
        for (int i = 0; i < MAX_LED; i++) {
            Set_LED(i, r, g, b);
        }

        // Update the last flash time to start a new fade cycle
        last_flash_time = current_time;
    }

    // Calculate elapsed time since the last flash
    uint32_t elapsed_time = current_time - last_flash_time;

    // Calculate brightness based on elapsed time
    int brightness;
    if (elapsed_time >= FADE_DURATION_MS) {
        brightness = 0;  // Fully faded out
    } else {
        // Linear fade: brightness decreases from NORMAL_BRIGHTNESS to 0
        brightness = NORMAL_BRIGHTNESS - (NORMAL_BRIGHTNESS * elapsed_time) / FADE_DURATION_MS;
    }

    // Apply the calculated brightness to the LEDs
    Set_Brightness(brightness);

    // Update the LED strip
    WS2812_Send();
}

void effect_dynamic_vu_meter(uint16_t amplitude, uint16_t peak_freq) {
    // Calculate ratio and number of LEDs to light
    float ratio = (float)amplitude / amp_maxn;
    if (ratio > 1.0f) ratio = 1.0f;

    if (ratio <= 0.05f) {
        Turn_off_all_at_once();
        return;
    }

    int total_leds_to_light = (int)(ratio * MAX_LED);
    if (total_leds_to_light < 1) total_leds_to_light = 1;

    // Get color based on frequency
    uint8_t r, g, b;
    frequency_to_full_spectrum(peak_freq, &r, &g, &b);

    // Clear all LEDs first
    Turn_off_all_at_once();

    // Light LEDs from center outward
    int center = MAX_LED / 2;
    int leds_per_side = total_leds_to_light / 2;

    // Light center LED if odd number
    if (total_leds_to_light % 2 == 1) {
        Set_LED(center, r, g, b);
    }

    // Light LEDs on both sides of center
    for (int i = 1; i <= leds_per_side; i++) {
        if (center - i >= 0) {
            Set_LED(center - i, r, g, b);
        }
        if (center + i < MAX_LED) {
            Set_LED(center + i, r, g, b);
        }
    }

    int brightness = 5 + (int)(ratio * (NORMAL_BRIGHTNESS - 5));
    Set_Brightness(brightness);
    WS2812_Send();
}

void effect_spectrum_color_bands(uint16_t amplitude, uint16_t peak_freq) {
    float ratio = (float)amplitude / amp_maxn;
    if (ratio > 1.0f) ratio = 1.0f;

    if (ratio <= 0.05f) {
        Turn_off_all_at_once();
        return;
    }

    // Define frequency bands and LED sections
    int low_start = 0;
    int low_end = MAX_LED / 3;
    int mid_start = low_end;
    int mid_end = (MAX_LED * 2) / 3;
    int high_start = mid_end;
    int high_end = MAX_LED;

    // Clear all LEDs
    Turn_off_all_at_once();

    // Determine which band the peak frequency falls into
    uint8_t r = 0, g = 0, b = 0;
    int start_led = 0, end_led = 0;

    if (peak_freq <= 250) {
        // Low frequency band - Red
        frequency_to_full_spectrum(peak_freq, &r, &g, &b);
        start_led = low_start;
        end_led = low_end;
    } else if (peak_freq <= 2000) {
        // Mid frequency band - Green
    	frequency_to_full_spectrum(peak_freq, &r, &g, &b);
        start_led = mid_start;
        end_led = mid_end;
    } else {
        // High frequency band - Blue
    	frequency_to_full_spectrum(peak_freq, &r, &g, &b);
        start_led = high_start;
        end_led = high_end;
    }

    // Light up the appropriate section
    for (int i = start_led; i < end_led; i++) {
        Set_LED(i, r, g, b);
    }

    int brightness = 5 + (int)(ratio * (NORMAL_BRIGHTNESS - 5));
    Set_Brightness(brightness);
    WS2812_Send();
}

void effect_rainbow_roll(uint16_t amplitude, uint16_t peak_freq) {
    static float offset = 0.0f;

    float ratio = (float)amplitude / amp_maxn;
    if (ratio > 1.0f) ratio = 1.0f;

    // Cập nhật offset dựa vào tần số đỉnh
    offset += ((float)peak_freq / 100.0f);  // tốc độ cuộn
    if (offset >= 360.0f) offset -= 360.0f;

    for (int i = 0; i < MAX_LED; i++) {
        float hue = fmodf(offset + (i * (360.0f / MAX_LED)), 360.0f);
        uint8_t r, g, b;
        HSV_to_RGB(hue, 1.0f, ratio, &r, &g, &b);
        Set_LED(i, r, g, b);
    }

